//Global story tags
# title: Бласлаўленьні Людзей
# frequency: Special
# development: false
# illustration: campfirenight

INCLUDE include.ink

->START

===START===
Спачатку трэба знайсьці сьвятыя фаліянты з апісаньнямі асобных абрадаў і бласлаўленьняў. Іх льга набыць у сьвятароў па ўсім краі. Аднак забытыя веды могуць трапіцца вам і падчас змаганьня зь небясьпечнымі пагрозамі, дасьледаваньня сховішчаў ды логаваў на кантынэнце.
Пасьля гэтага вы зможаце вывучыць бласлаўленьні з набытых кніг. Зразумела, даступныя вам бласлаўленьні залежаць ад вашай веры ці веры вашых кампаньёнаў: напрыклад, сьвятары Сігмара й ваўкі-сьвятары могуць заклікаць толькі сілы сваіх бостваў.
Вывучыўшы бласлаўленьні, зьвярніцеся да сьвятароў або накіруйцеся ў рамесьніцкі квартал любога гораду. Там вы зможаце накласьці бласлаўленьне на абраны прадмет. Аднак для гэтага спатрэбяцца пэўныя ўнікальныя матэрыялы…

Цяпер пра матэрыялы з магічнымі ўласьцівасьцямі:
Арканныя скруткі льга знайсьці сярод здабычы культыстаў цемры. Яны таксама могуць быць у тых, хто карыстаецца магіяй.
Кажуць, бурштынавыя крышталі паходзяць з чароўнага лесу Атэль Лорэн. У тых, хто хаваецца ў Эльфійскіх лясах, у дзіўнага люду й яшчэ дзіўнейшых зьвяроў, што блукаюць пад шатамі, напэўна знойдзецца бурштын.
Па бласлаўлёную ваду заўсёды можна зьвярнуцца ў шматлікія людзкія капішчы, але вандроўнікі кажуць, што бандыты й злодзеі Брэтоніі ды лясоў Лаўрэлорну таксама могуць мець яе пры сабе.
Цудоўныя каштоўныя камяні — скарбы дварфаў. Аднак можна меркаваць, што агідныя зялёнаскурыя таксама носяць каштоўныя камяні, нарабаваныя ў бітвах з горным народам. Яны карысныя й для чараваньня, таму тыя, хто карыстаецца магіяй, часта маюць іх пры сабе.
Мала каму ў жыцьці трапляецца такое моцнае рэчыва, як драконавая кроў… Магчыма, гэты рэдкі складнік ёсьць у найвышэйшых вайсковых чыноў, доблесных ваяводаў і шляхцічаў ці тых, хто дасягнуў вяршыняў рыцарства.
Што да праклятага варп-каменю, найагіднейшага з усіх рэчываў, дык трэба памятаць: у многіх цывілізаваных краінах гэты матэрыял строга забаронены. Каб здабыць яго, давядзецца біцца ля самых брамаў Хаосу або забіваць ягоных пякельных культыстаў. Асабліва сьмелыя знойдуць досыць гэтай брыдоты на спустошаных землях Сыльваніі. Але, вандроўнікі, сьцеражыцеся: у краі, вечна ахутаным змрокам і туманам, мёртвых часам болей, чым жывых.
    -> END
