//Global story tags
# title: Культысты Сярод Нас
# frequency: Special
# development: false
# illustration: village

INCLUDE include.ink
        
    VAR DealtWithCultists = false
    VAR CultName = "Культ Кхорна"
    VAR HardSkillCheckValue = 250
    VAR NormalSkillCheckValue = 150
    VAR EasySkillCheckValue = 80
    VAR ElderState = 0
        ~ ElderState = RANDOM(1,3) // 1 - normal, 2 - guilty, 3 - grumpy
    VAR SymbolLeftBehind = 1
        //~ SymbolLeftBehind = RANDOM(0,1)
    VAR CultIsKnownToPlayer = false
    VAR MassacreHappened = false
    VAR StruggleHappened = false

-> Start

===Start===
    Шлях да вёскі быў небясьпечны й віўся праз густыя лясы ды туманныя даліны. Набліжаючыся, вы заўважаеце мітусьню вяскоўцаў, занятых штодзённымі справамі. Аднак у паветры адчуваецца прыхаваная трывога за нацягнутымі ўсьмешкамі й ціхімі перашэптваньнямі.
    Вы пакідаеце сваю партыю ў лягеры за вёскай і вырашаеце самастойна й непрыкметна пачаць расьсьледаваньне. Назіраючы зь ценю, вы заўважаеце невялікую купку людзей ля вясковага пляцу, якія паводзяцца падазрона патаемна. Яны абменьваюцца ўмоўнымі позіркамі й гавораць прыцішанымі галасамі.
    ->choices

    =choices
    *[Падысьці да купкі людзей і падслухаць іхную размову. {print_player_skill_chance("Roguery", NormalSkillCheckValue)}]
        {perform_player_skill_check("Roguery", NormalSkillCheckValue): ->ListenToGroup.succeed | -> ListenToGroup.fail}
    *[Сабраць зьвесткі ў вяскоўцаў, не выклікаючы падазрэньняў.] ->InvestigateVillagers


=== ListenToGroup ===

    =succeed
    (ПОСЬПЕХ)
    Вы крадком набліжаецеся да купкі людзей, імкнучыся не прыцягнуць увагі. Стоячы воддаль, вы напружваеце слых, каб улавіць урыўкі размовы.
    
    «…абрад выкліку трэба правесьці неўзабаве, — трывожна шэпча адзін зь іх. — Нашая моц расьце з кожным днём».
    
    Іншы голас адказвае: «Мы мусім хаваць, хто мы насамрэч. Ордэн Храмоўнікаў мог выйсьці на наш сьлед. Паляўнічыя на ведзьмаў па ўсёй вёсцы нам не патрэбныя, інакш усё прапала».
    
    «Сустрэнемся сёньня ўначы ў Калысцы…»
    
    Купка разыходзіцца, і кожны зьнікае ў натоўпе. Вяскоўцы працягваюць свае штодзённыя справы, нібы ня ведаючы пра цемру, што хаваецца сярод іх. 
    ->Start.choices
    
    =fail
    (НЯЎДАЧА)
    Вы спрабуеце крадком наблізіцца да купкі людзей, не прыцягваючы ўвагі, аднак утойлівасьць — ня ваш моцны бок. Калі вы падыходзіце бліжэй, раптоўны рып выдае вашую прысутнасьць. 
    Яны пазіраюць у ваш бок, падазрона прымружыўшы вочы. Абмяняўшыся некалькімі хуткімі словамі, яны зьнікаюць у натоўпе.
    Спроба падслухаць правалілася, і вы міжволі задумваецеся, ці не страцілі ўжо перавагу нечаканасьці. 
    ->Start.choices


=== InvestigateVillagers ===
    Вы разумееце, што культысты ўмела хаваюць свае сапраўдныя абліччы. Высьветліць, хто яны, будзе няпроста. Вы вырашаеце пагаварыць зь вяскоўцамі й сабраць больш зьвестак.
    Размаўляючы з рознымі людзьмі, вы асьцярожна пытаецеся пра нядаўнія дзіўныя здарэньні, зьніклых людзей і чуткі пра цёмныя абрады. Некаторыя вяскоўцы трывожацца, расказваюць пра таямнічыя знакі ў патаемных закутках, невытлумачальныя зьнікненьні й дзіўныя агні, што з'яўляюцца ў навакольным лесе ўначы.
    ->choices

    =choices
    *[Знайсьці вясковага старасту й распытаць яго.] ->InterviewElder
    *[Выправіцца ў лес уначы й высьветліць крыніцу дзіўных агнёў.] ->Woods
    *[Дасьледаваць зьнікненьні, пагаварыўшы са сваякамі зьніклых.] ->InvestigateDisappearances
    * -> OutOfOptions


=== InterviewElder ===
{ElderState == 3: ->grumpy | ->normal}

    =normal
    Стараста, чалавек даволі заможны на фоне сьціплага жыцьця вёскі, жыве ва ўтульным доме непадалёк ад цэнтру.
    Вы стукаеце ў драўляныя дзьверы, і стараста зь цёплай усьмешкай запрашае вас унутр. У доме ўтульна: у каміне патрэсквае агонь, разьліваючы па пакоі лагоднае сьвятло. Вы сядаеце за невялікі драўляны стол, гатовыя абмеркаваць сваю трывогу наконт дзіўных падзеяў у вёсцы.
    {ElderState == 1:Калі вы пытаецеся ў старасты пра магчымую прысутнасьць культу ў вёсцы, ён слухае ўважліва, але са скептычным выразам твару. Ён адкідае думку пра культ, лічачы яе недарэчнай і надуманай. На ягоную думку, апошнія беды — толькі супадзеньні ці асобныя выпадкі.}
    {ElderState == 1:«Я разумею вашую занепакоенасьць, — кажа ён зь лёгкай паблажлівасьцю ў голасе. — Але запэўніваю: ніякага культу ў нашай вёсцы няма. Гэтыя дзіўныя падзеі можна патлумачыць натуральнымі прычынамі або занадта жывым уяўленьнем некаторых вяскоўцаў».}
    {ElderState == 1:Расчараваныя адмаўленьнем старасты, вы разумееце, што пераканаць яго выступіць супраць культу будзе надзвычай цяжка. Відавочна, трэба шукаць іншыя шляхі, каб спыніць пагрозу, якая расьце.}
    {ElderState == 2: Падчас размовы вы аглядаеце навакольле, заўважаючы тонкія прыкметы параўнальнага багацьця старасты. Срэбнае начыньне блішчыць у мяккім сьвятле сьвечак, карціны на сьценах паказваюць спакойныя краявіды, а вопратка старасты пашытая значна лепей, чым у звычайнага вяскоўца.}
    {ElderState == 2:Размова працягваецца, і стараста прызнае, што ў вёсцы ёсьць беды, але думку пра дзейнасьць культу лічыць зусім недарэчнай. Аднак вы заўважаеце ў ягоных вачах іскрынку трывогі — намёк на віну, які выдае больш за словы.}
    ->choices
    
    =grumpy
    Стараста, вядомы слабымі посьпехамі ў падтрыманьні парадку й разьвязаньні вясковых праблемаў, жыве ў сьціплым доме ў цэнтры вёскі. Набліжаючыся, вы заўважаеце паўсюль занядбаньне: зарослы сад, аблупленую фарбу на ўваходных дзьвярах і агульны беспарадак.
    Вы стукаеце ў драўляныя дзьверы, і стараста адчыняе іх з крыху раздражнёным выглядам. «Чаго вам?» — бурчыць ён незадаволена. Вы тлумачыце прычыну візыту, выказваючы трывогу наконт дзіўных падзеяў у вёсцы й магчымай прысутнасьці культу.
    «Думаеце, у нашай вёсцы культ? — кпіць ён зь недаверам у голасе. — Глупства! Нам і штодзённых клопатаў хапае без такіх дзікіх баек. Беды? Так, іх у нас шмат. Але культ? Ні ў якім разе».
    Калі вы працягваеце настойваць, спрабуючы пераканаць старасту ў сур'ёзнасьці сытуацыі, ён выходзіць зь сябе. «У мяне ёсьць больш пільныя справы, чым слухаць гэтую лухту! — агрызаецца ён з выразным раздражненьнем. — Хочаце расьсьледаваць — калі ласка. Але не дакучайце мне сваімі выдуманымі культамі!»
    З гэтымі словамі ён ляскае дзьвярыма перад вашым носам, і гук рэхам разносіцца па ціхіх вясковых вуліцах.
    Вы ня маеце выбару й мусіце знайсьці іншыя спосабы весьці расьсьледаваньне без супрацоўніцтва са старастам.
    ->InvestigateVillagers.choices
    
    =choices
    *{ElderState == 2}[Запатрабаваць ад старасты тлумачэньняў пра ягонае багацьце, абвінаваціўшы ў незаконных справах. {print_player_skill_chance("Charm", HardSkillCheckValue)}]
        {perform_player_skill_check("Charm", HardSkillCheckValue): -> InterviewElder.succeed | -> InterviewElder.fail}
    * -> InvestigateVillagers.choices

    =succeed
    (ПОСЬПЕХ)
    Твар старасты ўздрыгвае: прамата вашых абвінавачаньняў засьпела яго зьнянацку.
    У хвіліну слабасьці стараста прызнаецца, што атрымліваў невялікія сумы грошай, якія нехта таемна пакідаў на ягоным парозе. Хто прыносіў грошы, ён ня ведае, але прызнае, што заплюшчваў вочы на дзіўныя падзеі ў абмен на гэтыя хабаркі. У ягоным голасе гучыць сорам, калі ён тлумачыць, што грашовыя цяжкасьці й спакуса лепшага жыцьця для сям'і зацьмілі яму розум.
    Ён здаецца шчырым. Вы перакананыя, што ён сапраўды больш нічога ня ведае пра паходжаньне хабару.
    Хоць стараста й ня ведае падрабязнасьцяў, вы настойліва заклікаеце яго ўзяць адказнасьць за свае ўчынкі й парваць сувязі з таемным дабрадзеем. Вы падкрэсьліваеце, як важна аднавіць бясьпеку й дабрабыт вёскі, і просіце яго стаць хаўрусьнікам у барацьбе з культам.
    *[Пільнаваць наступную перадачу хабару, каб прасачыць за тым, хто яго прынясе.] -> wait
    *[Знайсьці іншыя шляхі для працягу расьсьледаваньня.] -> InvestigateVillagers.choices
    
    =fail
    (НЯЎДАЧА)
     Стараста горача адмаўляе ўсе абвінавачаньні. З абураным выглядам ён абараняецца, сьцьвярджаючы, што ягоны параўнальны дабрабыт — вынік разумнага распараджэньня грашыма й укладаньняў па-за вёскай. 
     Стараста ўмела адводзіць вашыя абвінавачаньні, прыпісваючы іх чуткам і зайздрасьці вяскоўцаў да ягонага сьціплага посьпеху. 
     Нягледзячы на вашыя падазрэньні, яму ўдаецца захаваць бачную невінаватасьць, пакінуўшы вам неадчэпныя сумневы ў ягоных сапраўдных намерах. 
     ->InvestigateVillagers.choices
    
    =wait
    Поўныя рашучасьці раскрыць таямніцу хабару, вы складаеце плян назіраньня за домам старасты ў чаканьні наступнай перадачы. Дні зьмяняюцца начамі, а вы цярпліва хаваецеся, пільнуючы хоць нейкі сьлед таямнічага пасланца. Але час мінае, ніхто не прыходзіць, і ночы застаюцца ціхімі.
    Расчараваньне й зьнямога нарастаюць, і вы пачынаеце сумнявацца ў дзейснасьці гэтага спосабу. Магчыма, хабарнік даведаўся пра вашую прысутнасьць або зьмяніў спосаб перадачы грошай. Адсутнасьць істотных зачэпак і зрухаў цяжарам кладзецца на вашую рашучасьць.
    Вы вырашаеце спыніць назіраньне, прызнаўшы, што гэты сьлед завёў у тупік.
    -> InvestigateVillagers.choices

===Woods===
    Зацікавіўшыся згадкай пра дзіўныя агні, вы вырашаеце пад покрывам ночы паглыбіцца ў лес. Напружыўшы ўсе пачуцьці й трымаючы зброю напагатове, вы прабіраецеся праз густое лісьце.
    
    Чым глыбей вы заходзіце ў лес, тым мацнейшым і чароўнейшым робіцца зьзяньне. Яно танчыць і мігціць узорамі, што здаюцца зладжанымі, амаль наўмыснымі.
    
    На сваё зьдзіўленьне, вы натрапляеце на некалькі незвычайна вялікіх раёў сьветлякоў, чые сьветлыя целы ствараюць захапляльнае відовішча. Яны трапечуцца й кружацца ў чароўным суладзьдзі, асьвятляючы дрэвы вакол сваім дзівосным зьзяньнем.
    
    Зразумеўшы, што менавіта сьветлякі былі крыніцай таямнічых агнёў, вы з захапленьнем назіраеце за іхным начным выступам. Гэта ня тыя культысты, якіх вы шукалі, але іхная прысутнасьць нагадвае пра прыгажосьць і цуды сьвету.
    
    Адчуваючы мір і спакой, вы на хвіліну спыняецеся, каб палюбавацца дзівам прыроды, перш чым працягнуць расьсьледаваньне.
    ->InvestigateVillagers.choices

===InvestigateDisappearances===
    Найперш вы зьвяртаецеся да сваякоў зьніклых. Вы са спачуваньнем слухаеце, суцяшаеце й падтрымліваеце іх, адначасова асьцярожна зьбіраючы зьвесткі. Кожны аповед поўны болю й разгубленасьці, і ўсе яны зьвязаныя невытлумачальнымі абставінамі. Ходзяць змрочныя чуткі пра нябачную сілу, якая тоіцца ў ценях вёскі.
    Адчуваючы, што нельга марудзіць, вы паглыбляецеся ў справу, шукаючы зачэпкі й сувязі. Вы складаеце схему месцаў зьнікненьняў і пазначаеце іх на імправізаванай дошцы расьсьледаваньня. Вымалёўваецца заканамернасьць: большасьць выпадкаў адбылася на ўскраінах вёскі й у навакольных лясах.
    ->choices
    
    =search
    Цьвёрда вырашыўшы знайсьці адказы, вы адпраўляецеся аглядаць дамы зьніклых людзей у надзеі знайсьці падказкі, што пральюць сьвятло на іхныя трывожныя зьнікненьні. У кожным доме паветра напоўненае сумам і неспакоем, нагадваючы пра жыцьці, якія раптоўна абарваліся.
    У адным з дамоў вы знаходзіце сьляды барацьбы: перакуленае крэсла, разьбітую вазу й бязладна раскіданыя рэчы. Відавочна, тут адбылося нешта нядобрае, і гаспадароў забралі сілай.
    У іншым доме вы знаходзіце пакінутыя асабістыя рэчы: дарагую сэрцу цацанку, недапісаны ліст і любімую кнігу. Гэтыя сьляды жыцьця намякаюць, што гаспадары зьніклі раптоўна й нечакана.
    Робіцца зразумела: зьніклыя людзі былі ахвярамі, іх забралі супраць волі.
    {SymbolLeftBehind == 1: Старанна аглядаючы дом са сьлядамі барацьбы, вы заўважаеце сярод беспарадку рэч, пакінутую злачынцамі. Пад перакуленым сталом старанна схаваны зламаны амулет з парваным ланцужком, які несумненна належыць культу, што вы шукаеце. -> identify_option}
    {SymbolLeftBehind == 0: Нягледзячы на пільны агляд дамоў зьніклых, вы не знаходзіце новых істотных зачэпак. Сьляды барацьбы й пакінутыя рэчы толькі паглыбляюць таямніцу, пакідаючы больш пытаньняў, чым адказаў. Расчараваньне й бездапаможнасьць ахопліваюць вас, калі вы разумееце, што сьлед астыў. ->InvestigateVillagers.choices}
    
    =identify_option
    *[Распазнаць сымбаль. {print_player_attribute_chance("Intelligence",5)}] -> identify_check
    
    =identify_check
    {perform_player_attribute_check("Intelligence", 5): -> succeed | -> fail}
    
    =succeed
    (ПОСЬПЕХ)
    ~ CultIsKnownToPlayer = true
    Вы адразу пазнаяце адметны сымбаль: {CultName}.
    Па сьпіне прабягае холад, калі вы разумееце значэньне знаходкі. Гэта характэрная рэч, зьвязаная з культам, якая пацьвярджае ягоны непасрэдны ўдзел у зьнікненьнях. 
    ->InvestigateVillagers.choices
    
    =fail
    (НЯЎДАЧА)
    Нягледзячы на пільны агляд сымбалю, вы ня можаце вызначыць ягоны сэнс ці значэньне. 
    Вы не знаходзіце новых істотных зачэпак. Загадкавы сымбаль, сьляды барацьбы й пакінутыя рэчы толькі паглыбляюць таямніцу, пакідаючы больш пытаньняў, чым адказаў. 
    ->InvestigateVillagers.choices
    
    =choices
    *[Уважліва абшукаць дамы зьніклых.] -> search


===OutOfOptions===

Нястомна правяраючы розныя зачэпкі й магчымасьці, вы ўсё ж мала прасунуліся ў разгадваньні складанай павуціны таямніцаў, што ахутала вёску. Расчараваньне й стома бяруць сваё: вы апынуліся на ростанях і ня ведаеце, які шлях абраць далей.

Пад цяжарам неразгаданых таямніцаў вы апынаецеся перад вясковай карчмой. Цёплае сьвятло яе вокнаў і спакусьлівы пах ежы вабяць унутр. Магчыма, вам якраз патрэбная хвіліна перадышкі, каб сабрацца з думкамі й перагледзець свае падыходы.

Седзячы ў карчме й разважаючы пра наступны крок, вы чуеце ўрывак размовы за суседнім сталом. Вяскоўцы жвава абмяркоўваюць заўтрашні сход — рэдкую нагоду, калі ўся вёска зьбярэцца разам абмеркаваць апошнія падзеі й клопаты. 

Уважліва прыслухаўшыся, вы даведваецеся, што сход адбудзецца на вясковым пляцы. Навіна вас цікавіць: гэта шанец паназіраць за рэакцыямі вяскоўцаў, ацаніць іхныя падазрэньні й, магчыма, заўважыць культыстаў, якія паспрабуюць зьліцца з натоўпам.

Вы міжволі разважаеце пра магчымасьці, якія дае такая падзея. Думка пра ўсю вёску, сабраную ў адным месцы разам з магчымымі культыстамі, запускае ў галаве чараду разьлікаў.

Ці не плянуюць культысты дзейнічаць падчас сходу? Ці скарыстаюцца яны натоўпам для сваіх задумаў, ці будуць проста назіраць зь ценю, хаваючы сапраўдныя намеры?

*[Прыйсьці на сход.] -> AttendGathering
*[Спыніць пошукі. Гэтае расьсьледаваньне ўжо забрала зашмат часу.] -> VoluntaryEnd

=== AttendGathering ===
Настае дзень вясковага сходу, і ў паветры зьмешваюцца чаканьне й асьцярога. Вы ідзяце на пляц, напружыўшы ўсе пачуцьці й увагу. Шумлівы натоўп, мора знаёмых твараў, хавае невядомае. Прабіраючыся паміж вяскоўцамі, вы захоўваеце пільнасьць і шукаеце позіркам прыкметы прысутнасьці культу.

Раптам вашую ўвагу прыцягвае ледзь заўважная зьмена настрою. Праз натоўп прабягае прыхаванае напружаньне, і вы заўважаеце некалькі падазроных людзей: крадлівыя позіркі, непранікальныя твары. Вы інстынктыўна сочыце за іхнымі рухамі. Падазрэньні пацьвярджаюцца, калі вы ловіце бляск кінжалаў, схаваных пад вопраткай.

Сэрца пачынае біцца хутчэй, калі вы разумееце сур'ёзнасьць сытуацыі. Культысты сярод вяскоўцаў, прыхаваныя й узброеныя. {CultIsKnownToPlayer: Зьвесткі пра {CultName} ясна сьведчаць: іхны | Іхны} намер — ня проста назіраць; яны плянуюць ударыць, разьвязаўшы хаос і гвалт.

Як вы паступіце?

*[Асьцярожна, не ўздымаючы панікі, паспрабаваць раззброіць культыстаў па адным. {print_player_skill_chance("Roguery", HardSkillCheckValue)}] -> DisarmCultists
*[Раскрыць вяскоўцам сапраўдную сутнасьць культыстаў і настроіць людзей супраць іх. {print_player_skill_chance("Charm", HardSkillCheckValue)}] -> ExposeCultists

=== ExposeCultists ===
{perform_player_skill_check("Charm", HardSkillCheckValue): -> succeed | -> fail}

    =succeed
    ~ StruggleHappened = true
    (ПОСЬПЕХ)
    Сабраўшы ўсю рашучасьць, вы ўзвышаеце голас над гамам, і вашыя ўладныя словы праразаюць страх і разгубленасьць. Вы настойліва выкрываеце прыхаваную пагрозу культыстаў, іхныя схаваныя кінжалы й намер учыніць расправу над нічога не падазравалымі вяскоўцамі. 
    
    Узрушэньне й недавер праносяцца праз натоўп: людзі глядзяць на сяброў і суседзяў, якіх выкрылі як паслугачоў Хаосу.
    
    Раз'юшаныя здрадай вяскоўцы выступаюць супраць культыстаў, якім больш ня вераць. Сутычка кароткая, але лютая: людзей яднае супольная мэта — абараніць сваю грамаду й пазбавіць яе ад гэтага зла.
    
    У мітусьні жменьцы культыстаў удаецца вырвацца з рук вяскоўцаў і зьнікнуць на зьвілістых вуліцах вакол пляцу.
    
    Астатніх хутка перамагаюць колькасьцю й абясшкоджваюць. Калі пыл асядае, пляц ахоплівае пачуцьцё трыюмфу й палёгкі. 
    ->choices

    =fail
    (НЯЎДАЧА)
    Вы выходзіце наперад сярод вясковага сходу, сэрца калоціцца ад пільнасьці вашай весткі. Ваш голас перакрывае гаману, прыцягваючы ўвагу тых, хто побач. Вы раскрываеце прыхаваную пагрозу: сярод іх ёсьць узброеныя культысты, якія рыхтуюць крывавую расправу, каб улагодзіць сваё цёмнае боства. 
    
    Але ледзь вашыя словы прагучалі, па натоўпе разыходзяцца недавер і скепсыс, нібы кругі ад каменя, кінутага ў ціхую сажалку. Вяскоўцы прымружваюць вочы, хмураць бровы й пераглядаюцца; некаторыя нават пасьмейваюцца з таго, што лічаць недарэчнай байкай. 
    ->CultistsAct
    
    =choices
    *[Кінуцца за найбліжэйшым культыстам, які ўцякае.] ->ChaseCultist

===DisarmCultists===
Рухаючыся з наўмыснай асьцярожнасьцю, вы прабіраецеся паміж вяскоўцамі, разьлічваючы кожны крок, каб не прыцягнуць увагі. Культысты занялі зручныя месцы па краях натоўпу, і, калі вы набліжаецеся да першага, сэрца калоціцца ад страху й рашучасьці.
{perform_player_skill_check("Roguery", HardSkillCheckValue): -> succeed | -> fail}

    =succeed
    (ПОСЬПЕХ)
    Апынуўшыся побач з культыстам, вы спрытна працягваеце руку да схаванага кінжала. Клінок халадзіць пальцы, калі вы выцягваеце яго з патаемных похваў, а культыст і не падазрае пра вашыя дзеяньні. 
    Вашыя рухі разьлічаныя, пачуцьці ловяць кожную дробязь. Вага кожнага адабранага клінка — і перамога, і змрочны напамін пра гвалт, які мог адбыцца. 
    Урэшце некаторыя з тых, каго вы раззброілі раней, заўважаюць нядобрае. Яны прымружваюцца, у вачах успыхвае падазрэньне. Вас ахоплівае паніка: вашыя дзеяньні не засталіся цалкам незаўважанымі.
    Культысты абменьваюцца трывожнымі позіркамі, і іхнае маўклівае паразуменьне выдае рашэньне: яны ўсьвядомілі, што страцілі перавагу нечаканасьці, на якую разьлічвалі. Яны пакідаюць свае месцы ў натоўпе й зьнікаюць у лябірынце вуліц вакол пляцу.
    ->choices
    
    =fail
    (НЯЎДАЧА)
    На імгненьне вашае сэрца замірае: культыст заўважае вашыя дзеяньні. У ягоных вачах успыхвае паніка, за якой ідзе імклівы адказ. Рэзка ўдыхнуўшы, ён спрабуе вырваць кінжал з вашай рукі. Перавага нечаканасьці страчаная, пачынаецца барацьба, якая прыцягвае ўвагу культыстаў побач.
    ->CultistsAct
    
    =choices
    *[Кінуцца за найбліжэйшым культыстам, які ўцякае.] ->ChaseCultist

===CultistsAct===
~ MassacreHappened = true
Прыхаваныя культысты карыстаюцца імгненьнем, каб ажыцьцявіць свой плян. Заняўшы зручныя месцы па краях сходу, яны выхопліваюць схаваныя кінжалы й сыходзяцца са злавесным намерам. 
Перш чым хто-небудзь пасьпявае адрэагаваць, культысты кідаюцца ў дзеяньне, іхныя клінкі блішчаць у дзённым сьвятле. Яны бязьлітасна сякуць усіх на сваім шляху, і пачынаецца хаос. Паветра напаўняюць крыкі жаху, вясковы пляц ператвараецца ў кашмарнае месца разьні. Страшная зладжанасьць культыстаў і ўзрушэньне вяскоўцаў не пакідаюць шанцу неадкладна ўцячы.
Сярод хаосу й жаху, што ахапілі вясковы пляц, вы заўважаеце нешта дзіўнае: на бруку з разьлітай крыві вымалёўваюцца ўзоры. Кінжалы культыстаў, якія дзейнічаюць з разьлічанай жорсткасьцю, ствараюць пунсовыя ручаінкі, што нібы сыходзяцца наўмысна пракладзенымі шляхамі.
Халодныя дрыжыкі прабягаюць па сьпіне, калі вы разумееце значэньне гэтых узораў: намер культыстаў куды падступнейшы за простую разьню. Пралітая імі кроў не марнуецца, яна служыць пэўнай мэце. Іхны цёмны абрад накіроўвае кроў у патаемныя глыбіні пад вясковым пляцам — жудасная цырымонія, каб улагодзіць крыважэрнае боства.

*[Скарыстацца лідарствам і згуртаваць частку вяскоўцаў для абароны.] -> RallyVillagers
*[Баючыся за ўласнае жыцьцё, уцячы з гэтага жаху й пакінуць марны квэст.]
    Калі перад вамі разгортваецца жахлівая мітусьня разьні, інстынкты бяруць верх і змушаюць дзейнічаць.
    Адрэналін праносіцца па жылах, калі вы адварочваецеся ад крывавага відовішча. Крыкі вяскоўцаў адгукаюцца ў вушах, падганяючы вас хутчэй рухацца ў адчайных пошуках выйсьця.
    Пакідаючы вёску зь яе таямніцамі, вы адварочваецеся ад хаосу, гвалту й цемры, якія паглыналі вашыя дні.
    ->END

===RallyVillagers===
Сярод хаосу на вясковым пляцы вашая рашучасьць распальвае іскру дзеяньня. Перакрыкваючы какофанію, вы зьвяртаецеся да ўсіх, хто можа пачуць, і вашыя словы гучаць настойліва й уладна.

«Вяскоўцы, трымайцеся разам!» — цьвёрдым голасам вы загадваеце ўзьвесьці барыкады з суседніх прылаўкаў і сталоў ды стаць на абарону ад націску культыстаў.

Жудаснае відовішча на вясковым пляцы зьмяняецца арганізаваным супрацівам, калі вяскоўцы гуртуюцца пад вашай камандай. Іхная імправізаваная зброя разам са збудаванымі перашкодамі ўтварае лінію абароны, якая становіцца сур'ёзным выклікам для кінжалаў культыстаў. 

Сутыкнуўшыся зь нечаканым супрацівам, культысты пачынаюць траціць рашучасьць. Яны спыняюцца перад супольным фронтам вяскоўцаў і здабытай тымі тактычнай перавагай. Да іх даходзіць, што нечаканасьці больш няма, а замест яе паўстала сіла супраціву, якой яны не прадбачылі.

Хутка прыняўшы рашэньне, культысты пачынаюць адступаць, іхныя крокі аддаляюцца, а постаці зьнікаюць удалечыні.
->choices

    =choices
    *[Кінуцца за найбліжэйшым культыстам, што ўцякае.] ->ChaseCultist
    
===ChaseCultist===
Поўныя непахіснай рашучасьці, вы кідаецеся ў пагоню за культыстамі, якія адступаюць зь вясковага пляцу. Зьвілістыя вуліцы й вузкія завулкі мільгаюць перад вачыма, пакуль вы прабіраецеся лябірынтам шляхоў, прагнучы адказаў і справядлівасьці.
Перасьлед урэшце прыводзіць вас да будынка, які стаіць асобна ад іншых: закінутага й часткова зруйнаванага, зьнявечанага часам і занядбаньнем. Уваход, схаваны за парванай заслонай павойных расьлінаў, намякае на цемру ўнутры. Крокі культыстаў сьціхаюць, калі яны зьнікаюць у гэтым злавесным праёме.
Зь мячом у руцэ вы вырашаеце ўвайсьці за імі.
->EnterHideout

===VoluntaryEnd===
    Зь цяжкім уздыхам вы прызнаяце, што гэтая загадка аказалася вам не пад сілу й пазбавіла вас часу ды спакою. Вы вырашаеце пакінуць вёску на волю лёсу. Кінуўшы апошні позірк, вы адварочваецеся, неахвотна пакідаючы цяжар пытаньняў без адказаў і няспраўджанай справядлівасьці.
->END

===EnterHideout===
~ OpenCultistLairMission("TOR_cultist_lair_001")
...
{DealtWithCultists: Калі апошні культыст падае пад вашым клінком, у памяшканьні настае аглушальная цішыня. Паветра напоўненае духам перамогі й водгульлем бою. Вы стаіце сярод палеглых культыстаў, і меч у вашай руцэ сьведчыць пра непахісную рашучасьць і майстэрства.}
{DealtWithCultists && MassacreHappened: Выйшаўшы з падзямельля, вы адчуваеце, як сэрца сьціскаецца ад відовішча на вясковым пляцы. Некалі жывое сэрца вёскі стала месцам невымоўнага жаху. Зямля ўсеяная целамі вяскоўцаў і культыстаў, чые жыцьці абарвала лютая сутычка.}
{DealtWithCultists && MassacreHappened: Кроў заліла брук, ператварыўшы зямлю ў жахлівае палатно трагедыі. У паветры стаіць пах жалеза й нядаўняй бітвы — цяжка паверыць, што толькі што пляц быў поўны сьвяточнай весялосьці. Рэшткі сутычкі, перакуленыя прылаўкі й разьбітыя сталы сьведчаць пра хаос, што тут панаваў.}
{DealtWithCultists && MassacreHappened: Замест былой жвавасьці пануе вусьцішная цішыня, якую парушаюць толькі далёкія ўсхліпы й ціхія крыкі ацалелых. Вяскоўцы, якія сталі побач з вамі супраць культыстаў, цяпер сутыкаюцца з жорсткай праўдай: за іхныя намаганьні давялося дорага заплаціць.}
{DealtWithCultists && not MassacreHappened && not StruggleHappened: Вы выходзіце са сховішча й ступаеце на пляц, сэрца ўсё яшчэ шалёна калоціцца пасьля сутычкі з культыстамі. }
{DealtWithCultists && not MassacreHappened && not StruggleHappened: Прабіраючыся праз натоўп, вы разумееце, што вашыя дзеяньні засталіся незаўважанымі. Вяскоўцы сьмяюцца й гутараць, захопленыя сьвятам, ня ведаючы пра злавесную змову, якая навісла над імі.}
{DealtWithCultists && not MassacreHappened && not StruggleHappened:Вы на хвіліну спыняецеся, каб адчуць цяпло й радасьць навокал. Дзеці гуляюць, дарослыя гутараць, а сяброўства вяскоўцаў сьведчыць пра іхныя супольныя повязі й стойкасьць. Цемру, што імкнулася пракрасьціся ў іхныя жыцьці, удалося стрымаць, і вашыя дзеяньні адыгралі вырашальную ролю ў захаваньні іхнага звыклага ладу.}
 {DealtWithCultists && not MassacreHappened: Культ зьнішчаны, прыхаваная пагроза ліквідаваная, і вёска можа далей квітнець у сьвятле новага дня.}
 {not DealtWithCultists: Вы ляжыце пераможаныя ў патаемным памяшканьні, дыханьне перарывістае, цела зьбітае, і цяжар няўдачы цісьне на вас. Халодныя каменныя сьцены, што былі сьведкамі лютага бою, цяпер нібы сьціскаюцца вакол — змрочны напамін пра цемру, якая ўзяла верх.}
 {not DealtWithCultists: Сярод цішыні вашай паразы да вушэй даносіцца далёкі гук — мноства сьпешных крокаў і гучных галасоў. Ваяры вашай партыі, якія стаялі лягерам за вёскай, цяпер сьпяшаюцца вам на дапамогу.}
 {not DealtWithCultists: Культысты, якім удалося адолець вас і якія раскрылі сябе, ужо па-за вашай дасяжнасьцю. Яны ўсьлізнулі, зьніклі, нібы дым на ветры, пакінуўшы вёску за сабою.}
 {not DealtWithCultists: Цяжка прыняць балючую праўду: культысты напэўна працягнуць сваё панаваньне цемры ў іншай вёсцы, якая нічога не падазрае.}
->END