//Global story tags
# title: Даві й Рунная Магія
# frequency: Special
# development: false
# illustration: campfirenight

INCLUDE include.ink

->START

===START===
Спачатку трэба знайсьці фаліянты й скруткі з апісаньнямі абрадаў асобных рунаў. Іх можна набыць у рунных кавалёў па ўсім Караз Анкоры. Аднак даўно забытыя руны могуць трапіцца вам і падчас змаганьня зь небясьпечнымі пагрозамі, дасьледаваньня сховішчаў ды логаваў на кантынэнце.
Пасьля гэтага вы зможаце вывучыць руны з набытых скруткаў. Вывучыўшы іх, зьвярніцеся да рунных кавалёў або накіруйцеся ў рамесьніцкі квартал любога караку. Там вы зможаце нанесьці руны на абраны артэфакт. Аднак для гэтага спатрэбяцца пэўныя ўнікальныя матэрыялы…
Што да наймагутнейшых рунаў, баюся, веды пра іх для нас страчаныя. Нашыя рунныя кавалі й шматлікія падземныя эксьпедыцыі няспынна шукаюць гэтыя забытыя веды. Я б не зьдзівіўся, калі б такія руны знайшліся ў найцямнейшых і найнебясьпечнейшых кутках гаспадарства.

Цяпер пра матэрыялы з магічнымі ўласьцівасьцямі:
Арканныя скруткі можна знайсьці сярод здабычы культыстаў цемры. Яны таксама могуць быць у тых, хто карыстаецца ненадзейнай магіяй.
Кажуць, бурштынавыя крышталі паходзяць зь лесу Атэль Лорэн, панства вутэльгі. У тых, хто хаваецца ў лясах, у дзіўных эльфаў і яшчэ дзіўнейшых зьвяроў, што блукаюць пад дрэвамі, напэўна знойдзецца бурштын.
Па бласлаўлёную ваду заўсёды можна зьвярнуцца ў шматлікія людзкія капішчы, але нашыя рэйнджары й суродзічы з далёкіх цьвярдыняў сьцьвярджаюць, што бандыты й злодзеі Брэтоніі ды лясоў Лаўрэлорну таксама могуць мець яе пры сабе. Аднак сьвятары Імперыі ня надта зычлівыя да чужынцаў.
Цудоўныя каштоўныя камяні — скарбы нашага гордага гаспадарства. Аднак уркі й гробскія падонкі часта носяць каштоўныя камяні, нарабаваныя ў нашых руднях. Гэтыя сьмярдзючыя зялёнаскурыя яшчэ пашкадуюць, што ўварваліся ў нашыя цьвярдыні, і за кожную крыўду будзе адплочана.
Каштоўныя камяні карысныя й для чараваньня, таму тыя, хто карыстаецца магіяй, часта маюць іх пры сабе.
Мала каму ў жыцьці трапляецца такое моцнае рэчыва, як драконавая кроў… Магчыма, гэты рэдкі складнік ёсьць у найвышэйшых вайсковых чыноў, доблесных вайскаводаў і шляхцічаў ці тых, хто дасягнуў вяршыняў рыцарства.
Што да праклятага тэнгдуразу, разбэшчвальнага варп-каменю, найагіднейшага з усіх рэчываў, дык трэба памятаць: у многіх цывілізаваных краінах гэты матэрыял строга забаронены. Каб здабыць яго, давядзецца біцца ля самых брамаў Хаосу або забіваць ягоных культыстаў. Асабліва сьмелыя знойдуць удосталь гэтай брыдоты на спустошаных землях Сыльваніі. Але, вандроўнікі, сьцеражыцеся: у краі, вечна ахутаным змрокам і туманам, мёртвых часам болей, чым жывых.
    -> END
