//Global story tags
# title: Зачараваньне й Артэфакты
# frequency: Special
# development: false
# illustration: campfirenight

INCLUDE include.ink

->START

===START===


->choices


    =choices
    + [Прачытаць пра зачараваньне.]->Beginning 
    + [Прачытаць пра складнікі.]->Ingredients
    + [Прачытаць пра магічныя прадметы.]->MagicItems 
    + [Зачыніць кнігу] -> END

===Beginning===


Спачатку трэба знайсьці кнігі з асобнымі формуламі зачараваньня. Іх можна набыць у чараўнікоў па ўсім краі. Аднак забытыя веды могуць трапіцца вам і падчас змаганьня зь небясьпечнымі пагрозамі, дасьледаваньня сховішчаў ды логаваў на кантынэнце.
Пасьля гэтага вы зможаце вывучыць формулы зачараваньня з набытых кніг. Зразумела, даступныя вам формулы залежаць ад вашага занятку ці занятку вашых кампаньёнаў: кожны можа кіраваць толькі тымі Вятрамі Магіі, зь якімі мае сувязь. Да таго ж чужыя народы ніколі ня дзеляцца сваімі таямніцамі з чужынцамі. Вывучыўшы формулы, зьвярніцеся да чараўнікоў або накіруйцеся ў рамесьніцкі квартал любога гораду. Там вы зможаце ўжыць формулы да абранага прадмета. Аднак для гэтага спатрэбяцца пэўныя ўнікальныя матэрыялы…



+ [Прачытаць выходныя зьвесткі]->START

=== Ingredients === 

Цяпер пра матэрыялы з магічнымі ўласьцівасьцямі:
Арканныя скруткі можна знайсьці сярод здабычы культыстаў цемры. Яны таксама могуць быць у тых, хто карыстаецца магіяй.

Кажуць, бурштынавыя крышталі паходзяць з чароўнага лесу Атэль Лорэн. У тых, хто хаваецца ў эльфійскіх лясах, у дзіўнага люду й яшчэ дзіўнейшых зьвяроў, што блукаюць пад шатамі, напэўна знойдзецца бурштын. 
Па бласлаўлёную ваду заўсёды можна зьвярнуцца ў шматлікія людзкія капішчы, але вандроўнікі кажуць, што бандыты й злодзеі Брэтоніі ды лясоў Лаўрэлорну таксама могуць мець яе пры сабе. Аднак сьвятары Імперыі ня надта зычлівыя да чужынцаў.  
Цудоўныя каштоўныя камяні — скарбы дварфаў. Аднак можна меркаваць, што агідныя зялёнаскурыя таксама носяць каштоўныя камяні, нарабаваныя ў бітвах з горным народам. Яны карысныя й для чараваньня, таму тыя, хто карыстаецца магіяй, часта маюць іх пры сабе. 
Мала каму ў жыцьці трапляецца такое моцнае рэчыва, як драконавая кроў… Магчыма, гэты рэдкі складнік ёсьць у найвышэйшых вайсковых чыноў, доблесных ваяводаў і шляхцічаў ці тых, хто дасягнуў вяршыняў рыцарства. 
Што да праклятага варп-каменю, найагіднейшага з усіх рэчываў, дык трэба памятаць: у многіх цывілізаваных краінах гэты матэрыял строга забаронены. Каб здабыць яго, давядзецца біцца ля самых брамаў Хаосу або забіваць ягоных пякельных культыстаў. Асабліва сьмелыя знойдуць удосталь гэтай брыдоты на спустошаных землях Сыльваніі. Але, вандроўнікі, сьцеражыцеся: у краі, вечна ахутаным змрокам і туманам, мёртвых часам болей, чым жывых.

+ [Прачытаць выходныя зьвесткі]->START
    
=== MagicItems === 

Магічныя прадметы сустракаюцца па ўсім Старым Сьвеце. Часам іхнія ўласьнікі нават ня ведаюць, чым валодаюць, а часам іхнія ўяўленьні — толькі забабоны. 
Калегія Магаў просіць дастаўляць усе артэфакты, створаныя нелюдзьмі, у Арканную Акадэмію для вывучэньня.
Вашыя намаганьні будуць узнагароджаныя: Калегія Магаў адзьдзячыць за добрую волю імперскімі маркамі, а мы паклапоцімся, каб у Імперыі пра іх даведаліся.

+ [Прачытаць зьмест]->START

