//Global story tags
# title: Лясны Кірмаш
# frequency: Uncommon
# development: false
# illustration: trader

INCLUDE include.ink

VAR HorsePrice = 2000
VAR FoodPrice = 10
VAR HorseBetPrice = 500
VAR HorseBetPayout = 2500
VAR WinHorseRace = 0
    ~ WinHorseRace = RANDOM(0,1)
VAR TurnipPrice = 50

-> Start

===Start===




Калі вашае войска рухаецца далей, за дрэвамі раптам адкрываецца паляна зь нечаканым відовішчам — шумлівым кірмашом, вядомым як Гуляньне Морсьлібу. Ганарліва ўздымаюцца намёты, іхныя фарбы гуляюць у сонечных плямах. Сьмех зьмешваецца з конскім пырханьнем — сэрцам гэтага вясёлага зборышча. #STR_Start1

Гандляры завабліваюць пакупнікоў, хітравата бліскаючы вачыма й прапануючы коней таньней за звычайныя цэны, пазначаныя ў скрутках. У паветры лунаюць спакусьлівыя пахі смажанага мяса, пеністага элю й даўкага віна. Сярод вясёлага натоўпу ўсьміхаецца земляроб, які прапануе рэпу, дзіўна падобную да славутай двуххвостай камэты. Усяго за драбязу вы можаце завалодаць гэтым незвычайным дзівам. #STR_Start2
    ->choices

    =choices
    * [Далучыцца да натоўпу на конскім кірмашы.]->HorseStalls 
    * [Пакаштаваць кірмашовых страваў.]->FoodStalls
    * [Выпрабаваць удачу на скоках.]->HorseRaces
    * [Аглядзець незвычайную рэпу.]->Turnip
    * [Працягнуць падарожжа празь лес.]->Leave

===HorseStalls===
Найбольш жвава кірмаш віруе там, дзе прадаюць коней. Ганарлівыя жарабцы гарцуюць, люта пазіраючы дзікімі вачыма. Адзін конь асабліва прыцягвае вашую ўвагу. Ягоная гладкая вараная поўсьць блішчыць на сонцы, а ў вачах нібы іскрыцца разуменьне. #STR_HorseStalls1
    ->choices

    =choices
    + [Прыняць прапанову гандляра й купіць каня. ({HorsePrice} залатых)]->BuyHorse
    * [Пераканаць гандляра зьнізіць цану. {print_player_skill_chance("Charm",150)}]->PersuadeMerchant
    * [Вярнуцца ў гушчу кірмашу.]->Start.choices

===BuyHorse===
{HasEnoughGold(HorsePrice): Вы дамаўляецеся з гандляром і аддаяце манеты ў абмен на моцнае сядло й павады. З радасным прадчуваньнем вы сядаеце на каня. Паміж вамі адразу ўзьнікае сувязь: здаецца, конь з даверам і ахвотай адгукаецца на ваш дотык. {GiveGold(-HorsePrice)} {GiveItem("t2_empire_horse",1)} | Вам бракуе золата. #STR_BuyHorse1NOTENOUGHGOLD }  #STR_BuyHorse1

* [Вярнуцца да гуляньня]->Start.choices

===PersuadeMerchant===
{perform_player_skill_check("Charm",150): -> success | -> fail}

    =success
    Вашыя словы робяць цуд, і гандляр згаджаецца зьнізіць цану на 50%. Ён бурчыць, але паважае вашае ўменьне таргавацца. #STR_PersuadeMerchant_Success
    ~HorsePrice = 1000
    ->HorseStalls.choices

    =fail
    Нягледзячы на ўсе вашыя спробы патаргавацца, гандляр цьвёрда трымаецца сваёй цаны. #STR_PersuadeMerchant_Fail
    ->HorseStalls.choices
    

===FoodStalls===
Спакусьлівыя пахі вядуць вас да сапраўднага сьвята смаку. Мяса шыпіць, эль пеніцца — асалода для ўсіх пачуцьцяў. Ежы тут удосталь, і толькі вам вырашаць, ці далучыцца да пачастунку. #STR_FoodStalls1

* [Пачаставацца на кірмашы. ({FoodPrice} залатых)]->BuyFood
* [Устрымацца ад спакусы й пайсьці далей.]->Start

===BuyFood===
{HasEnoughGold(FoodPrice): Спакуса перамагае. Вы ласуецеся, і кірмашовыя прысмакі складаюцца ў цудоўную сымфонію на вашым языку. Гандляры ўхвальна ківаюць, гледзячы, як вы ясьце. {GiveGold(-FoodPrice)} | Вам бракуе золата. #STR_BuyFood1NOTENOUGHGOLD}#STR_BuyFood1

* [Вярнуцца да гуляньня.]->Start.choices

===HorseRaces===
З амфітэатру даносяцца захопленыя воклічы. Грукочуць капыты, і вершнікі падганяюць коней насустрач хвале. #STR_HorseRaces
->choices

    =choices
    * [Паставіць на каня. ({HorseBetPrice} залатых — выплата ў пяць разоў большая за стаўку ў выпадку перамогі)]->PlaceBet
    * [Вырашыць, што ня варта выпрабоўваць удачу.]->Start.choices

===PlaceBet===
{not HasEnoughGold(HorseBetPrice): Вам бракуе золата. #STR_PlaceBet_NOTENOUGHGOLD -> HorseRaces.choices } 
~GiveGold(-HorseBetPrice)
{WinHorseRace: ->success | ->fail}
    =success
    Сэрца калоціцца, калі вы робіце стаўку. Абраны вамі конь вырываецца наперад, і ўдача ўсьміхаецца вам. Навокал гучаць сьмех і звон манетаў. #STR_PlaceBet_Success
    ~ GiveGold(HorseBetPayout)
    * [Вярнуцца да вясёлага натоўпу.]->Start.choices

    =fail
    Сэрца калоціцца, калі вы робіце стаўку. Абраны вамі конь спачатку імкліва вырываецца наперад, але неўзабаве астатнія вершнікі яго даганяюць. Урэшце ён запавольваецца й прыходзіць адным з апошніх. Навокал гучаць сьмех і звон манетаў.
        #STR_PlaceBet_Fail
    * [Вярнуцца да вясёлага натоўпу.]->Start.choices

===Turnip===
Вы зь цікаўнасьцю разглядаеце рэпу ў форме камэты — мудрагелістае дзіва прыроды. Земляроб усьміхаецца й запрашае вас узяць удзел у розыгрышы. #STR_Turnip1
    ->choices

    =choices
    * [Выпрабаваць удачу й набыць квіток на розыгрыш. ({TurnipPrice} залатых)]->BuyTicket
    * [Уважліва агледзець рэпу й пашукаць прыхаваныя падказкі. {print_player_skill_chance("Roguery", 80)}]->PerceiveTurnip
    * [Пайсьці далей, пакінуўшы незвычайную рэпу.]->Start.choices

===BuyTicket===
{HasEnoughGold(TurnipPrice): Аддаўшы манэты, вы з усьмешкай атрымліваеце шанец на выйгрыш. Хто ведае? Можа, рэпа, пацалаваная камэтай, усё ж будзе вашай. {GiveGold(-TurnipPrice)} | Вам бракуе золата. #STR_BuyTicket1NOTENOUGHGOLD  -> Turnip.choices}  #STR_BuyTicket1

Усе заміраюць у чаканьні, розыгрыш пачынаецца. Калі абвяшчаюць нумар пераможнага квітка, вы затойваеце дыханьне. Аднак гэтым разам удача не на вашым баку. Пераможны нумар не супадае з вашым, і вас ахоплівае расчараваньне. #STR_BuyTicket2

* [Вярнуцца да вясёлага гуляньня.]->Start.choices

=== PerceiveTurnip ===
{perform_player_skill_check("Roguery", 80): -> success | ->fail}

    =success
    Вашае пільнае вока заўважае дробязі, якія іншыя маглі б прапусьціць. На рэпе няма ніякіх незвычайных знакаў, якія сьведчылі б пра яе асаблівую значнасьць. Гэта самая звычайная рэпа.   #STR_PerceiveTurnip_Success
    ->Turnip.choices
    
    =fail
    Агляд не выяўляе ў рэпе нічога незвычайнага. #STR_PerceiveTurnip_Success
    ->Turnip.choices

===Leave===
Кірмашовы гоман заціхае, і вы зноў ступаеце ў абдымкі дзікай прыроды, пакідаючы за сьпінай сьмех вясёлага гуляньня. #STR_Leave1
->END
