//Global story tags
# title: Фартэца Фозрыка
# frequency: Rare
# development: false
# illustration: castle

INCLUDE include.ink

-> Start

=== Start ===
Падарожжа па дзікіх мясьцінах прыводзіць вас да ўскрайку густога лесу. Выйшаўшы з-за дрэваў, вы бачыце нешта велічнае й таямнічае — высокую цытадэль, якая нібы кідае выклік самім законам прыроды. #STR_Start1

Набліжаючыся да падножжа цытадэлі, вы разглядаеце мудрагелістую разьбу на яе сьценах: кожны ўзор апавядае пра даўно мінулыя часы. Высокія сьпічакі, увянчаныя віхурамі Вятроў Магіі, сягаюць да нябёсаў, увасабляючы моц і вытанчанасьць. Гэта замак, не падобны да іншых: яго трымае ў паветры магічнае майстэрства, даўно забытае большасьцю й жаданае імператарамі ды каралямі ўсіх земляў. Лятучая Фартэца — сапраўдны цуд, увасобленая ў камені мара чараўніка. #STR_Start2

Які шлях вы абярэце? #STR_Start3

* [Аглядзець цытадэль бліжэй.] -> InvestigateCitadel
* [Рушыць далей.] -> ContinueOn

=== InvestigateCitadel ===
Цікаўнасьць змушае вас падысьці бліжэй, і вашыя крокі адбіваюцца рэхам ля высокай цытадэлі. Але яшчэ да таго, як вы набліжаецеся, перад вачыма разгортваецца незвычайнае відовішча. Будынак ажывае, падпарадкоўваючыся загадкавай сіле, што нібы сыходзіць зь ягоных нетраў. #STR_InvestigateCitadel

Каменныя сьцены складваюцца адна за адной. З кожным плыўным рухам велічная цытадэль меншае, і яе вялізны аб'ём сьціскаецца ў шмат разоў. За лічаныя імгненьні манумэнтальная фартэца ператвараецца ў малюсенькае падабенства самой сябе — відовішча, ад якога вы ня можаце адвесьці вачэй. #STR_InvestigateCitade2

Калі вы даходзіце да месца, дзе стаяла цытадэль, там ужо пуста, нібы сама зямля праглынула яе цалкам. Захапленьне й зьбянтэжанасьць напаўняюць вашае сэрца, падахвочваючы разгадаць таямніцу гэтага магічнага з'явішча. #STR_InvestigateCitade3

* [Скарыстацца ведамі магіі, каб зразумець асаблівасьць фартэцы. {print_party_skill_chance("Spellcraft", 200)}]-> SpellcraftCheck
* [Не зважаць на гэтае з'явішча.]-> DismissPhenomenon

=== SpellcraftCheck ===
{perform_party_skill_check("Spellcraft",200): -> success | -> fail}

    =success
    (ПОСЬПЕХ)
    Абапіраючыся на свае веды магіі, вы спрабуеце разабрацца ў тым, што адбылося. І раптам прыходзіць разуменьне. Паданьні пра Фозрыка, загадкавага чараўніка-дойліда, перагукаюцца з убачаным. #STR_SpellcraftCheckSuccess1
    
    Цытадэль, на якую вы натрапілі й якая цяпер зьнікла, цалкам адпавядае аповедам пра дзівосныя Лятучыя Фартэцы Фозрыка. Гэтыя велічныя збудаваньні маглі насуперак здароваму сэнсу складвацца да памераў куфра або на загад разгортвацца ў высокія цытадэлі. Вашае разуменьне пранікае праз заслону таямніцы й адкрывае сакрэты майстэрства Фозрыка. #STR_SpellcraftCheckSuccess2
    
    Узбагаціўшыся новымі ведамі, вы крочыце далей: разуменьне прыроды цытадэлі асьвятляе ваш шлях па дзікіх мясьцінах. #STR_SpellcraftCheckSuccess3
    -> END
 
    =fail
    (НЯЎДАЧА)
    Вы напружваеце розум, спрабуючы разгадаць сакрэт зьніклай цытадэлі, але заходзіце ў тупік. Тонкасьці гэтага майстэрства застаюцца таямніцай і не паддаюцца вашым спробам зразумець іх. Зьнікненьне цытадэлі сьведчыць пра неспасьціжнасьць магічных майстэрстваў і пакідае па сабе цікаўнасьць, зьмяшаную з прыкрым расчараваньнем. Нягледзячы на ўсе намаганьні, загадка гэтага збудаваньня застаецца неразгаданай — яшчэ адной сярод незьлічоных таямніцаў сьвету. #STR_SpellcraftCheckFail1
    -> END

=== DismissPhenomenon ===
Хаця зьнікненьне цытадэлі й бянтэжыць вас, вы вырашаеце адкласьці загадку й засяродзіцца на падарожжы. Таямніцы часам не паддаюцца нават найпраніклівейшым розумам, а роздумы над імі могуць адвесьці вас ад уласных мэтаў. #STR_DismissPhenomenon1


-> END

=== ContinueOn ===
Захаваўшы ў памяці вобраз зьніклай цытадэлі, вы працягваеце падарожжа. #STR_ContinueOn1

Вы ідзяце далей, а думкі пра фартэцу не пакідаюць вас: яна сьведчыць пра спалучэньне магіі й дойлідзтва, якое выходзіць за межы звыклых уяўленьняў пра сьвет. #STR_ContinueOn2

* -> END
