//Global story tags
# title: Вандроўныя Трубадуры
# frequency: Special
# development: false
# illustration: minstrel


INCLUDE include.ink

->START

===START===
~ PlayMusic("west_bretonnia")
У дарозе да вас даносіцца жвавая размова трубадураў, якія захоплена нешта абмяркоўваюць. Іхныя яркія ўборы й энэргічныя жэсты выдаюць супольны запал да свайго рамяства. Цікаўнасьць вабіць вас бліжэй, і, калі вы падыходзіце, размова непрыкметна ператвараецца ў імправізаваны выступ. #STR_Start1

Зачараваныя іхнымі зладжанымі галасамі, вы вырашаеце застацца й паслухаць. Музыка трубадураў пляце аповед, які кажа больш за простыя словы. Рытм песьні яднае вас у супольным імгненьні, дзе клопаты й нявызначанасьць сьвету нібы адыходзяць прэч. #STR_Start2

Калі выступ дасягае вяршыні, трубадуры пераглядаюцца й усьміхаюцца ад радасьці супольнай творчасьці. Нарэшце гучыць апошняя, трыюмфальная нота, і песьня сканчаецца. #STR_Start3

*[Запляскаць у ладкі] -> Applaud
*[Выказаць удзячнасьць] -> Appreciate

===Applaud===
Захопленыя чарамі імгненьня, вы пляскаеце ў ладкі разам з усімі, хто сабраўся, — маўклівая даніна прыгажосьці, якую вы толькі што перажылі разам. #STR_Applaud1
->Leave

===Appreciate===
З удзячным сэрцам вы шчыра дзякуеце трубадурам за выступ. Яны з разуменьнем пераглядаюцца, цёпла й шчыра ўсьміхаючыся.
#STR_Appreciate2
->Leave

===Leave===
Яшчэ раз удзячна кіўнуўшы, вы пакідаеце трубадураў працягваць іхнае музычнае падарожжа й рушыце сваёй дарогай, несучы з сабою ўспамін пра нечаканы выступ. #STR_Leave1
(Націск на «Канец» спыніць музыку, калі яна яшчэ грае.) #STR_Leave2
->END