//Global story tags
# title: Цуд Веры
# frequency: Special
# development: false
# illustration: tresure_chest


INCLUDE include.ink

->START

===START===
~ GiveMiracleItem()
Вы стаіце перад алтаром боства, якое даўно шануеце, поўныя пашаны й чаканьня. У паветры адчуваецца старажытная моц, і вы ня можаце стрымаць лёгкага хваляваньня. #STR_Start1
Укленчыўшы перад алтаром, вы заплюшчваеце вочы й прамаўляеце шчырую малітву. Вы кажаце пра сваю адданасьць і непахісную веру. Словы ліюцца з вашых вуснаў, нібы мэлёдыя, узносячы вашую пабожнасьць да нябёсаў. #STR_Start2
Вас ахінае цёплая й лагодная прысутнасьць, нібы само паветра адгукаецца на вашую адданасьць. Вы расплюшчваеце вочы й бачыце, як зьверху сыходзіць яркае сьвятло, купаючы вас у незямным зьзяньні. Сьвятло набывае абрысы мігатлівай постаці. #STR_Start3
Плыўным рухам постаць працягвае да вас раскрытую далонь. На ёй вы бачыце прамяністы артэфакт, што пульсуе сьвятлом, — боскі дар. #STR_Start4
З трапятаньнем і ўдзячнасьцю вы працягваеце руку й прымаеце прадмет з далоні постаці. Ягонае цяпло пранізвае вас, напаўняючы моцай і пачуцьцём прызначэньня. #STR_Start5
Калі вы пакідаеце капішча, сьвет вакол здаецца ярчэйшым, нібы бласлаўленьне вашага боства асьвятліла вам шлях. З боскім дарам у руках вы ўпэўнена крочыце ў будучыню, гатовыя сустрэць любыя выпрабаваньні й ведаючы, што вы не адны. #STR_Start6
->END