//Global story tags
# title: Вёска ў Палоне Чумы
# frequency: Special
# development: false
# illustration: village

INCLUDE include.ink

VAR EXTREMESKILLCHECK = 1500
VAR NORMALSKILLCHECK = 150
VAR EASYSKILLCHECK = 50
VAR found_vial = false
VAR suspicious = false
VAR found_passage = false
VAR met_healer = false
VAR found_age = false
VAR DealtWithCultists = false
VAR MadeDealWithCultists = false

->START


===START===
Вы пакідаеце сваю партыю ў лягеры на ўскрайку вёскі й вырашаеце ўвайсьці туды самастойна, апрануўшы простую вопратку, каб не прыцягваць увагі. Ледзь вы ступаеце ў вёску, у ноздры ўдарае агідны смурод. Паветра цяжкае ад паху гнілі, зьмешанага зь неадчэпным духам адчаю. Вузкія пустэльныя вуліцы віюцца паміж струхлелымі будынкамі, чые фасады зьнішчаныя часам і занядбаньнем. Вяскоўцы, калісьці жвавыя й жыцьцярадасныя, цяпер сунуцца, нібы змучаныя здані: іхную жыцьцёвую сілу згасіла бязьлітасная хватка невядомай чумы.

Хваравітая смуга ахутвае вёску, надаючы ўсяму мёртвую бледнасьць. Дзьверы рыпяць на іржавых завесах, некалі яркія фарбы выцьвілі й аблупіліся. Зачыненыя аканіцы выдаюць страх, што пануе ўнутры, нібы вяскоўцы замкнуліся ад усяго сьвету. Тут і там мігатлівыя ліхтары слаба асьвятляюць ахоўныя знакі, у роспачы накрэсьленыя на сьценах крывёю й попелам, — марныя спробы адагнаць заразу.

Сярод спусташэньня некалькі постацяў супрацьстаяць бязьлітаснаму націску хваробы. Яны рухаюцца ўпэўнена, а ў вачах цепліцца іскра стойкасьці. Гэтыя ацалелыя насьцярожана азіраюцца, іхных целаў не закранула немач, якая зьнявечыла суседзяў. Іхнае існаваньне, нібы кволыя вугольчыкі сярод наступнай цемры, сьведчыць, што ў вёскі яшчэ маецца надзея. -> choices

    =choices
    *[Распытаць вяскоўцаў.] -> QuestionVillagers
    *[Прайсьціся па вёсцы, уважліва прыглядаючыся да ўсяго.] -> ObserveVillage
    *{suspicious}{not found_age} [Распытваць пра лекара.] -> AskAboutHealer
    *{found_vial || (found_age && met_healer)}[Сабрацца з думкамі й абдумаць знаходкі.] -> GatherThoughts


===QuestionVillagers===
Вы падыходзіце да самотнага вяскоўца сярод зьнясіленага люду, і ў ягоных вачах мільгае іскра стойкасьці. Зацікавіўшыся, вы задаяце пытаньне, якое цяжарам ляжыць на душы: пра чуму. 
Стомлена пазіраючы, вясковец ціха адказвае: «Чума… яна мучыць нас ужо некалькі месяцаў. Столькі жыцьцяў страчана, столькі пакутаў перажыта». У ягоным голасе адчуваецца цяжар асабістага досьведу, у якім адбіваецца супольны боль, што пранізвае паветра. 
Ён паказвае на жытло вясковага лекара, аддаючы належнае ягонай непахіснай адданасьці перад абліччам адчаю, і кажа: «Знайдзіце лекара. Ён стаў нашым прамянём надзеі, нястомна змагаецца з гэтай неадступнай немаччу». ->choices 

    =choices
    *{not met_healer}[Паслухацца парады й знайсьці вясковага лекара.] -> AtTheHealers
    *{met_healer}[Вярнуцца ў жытло лекара ў надзеі гэтым разам застаць яго там.] -> AtTheHealers

===AskAboutHealer===
Вы вырашаеце асьцярожна распытаць вяскоўцаў пра лекара. У размовах заўважаеце агульную рысу ўсіх адказаў: колькі людзі сябе памятаюць, лекар заўсёды быў апорай вёскі. Пакаленьні спадзяваліся на ягонае майстэрства, а ягоныя веды пераходзілі з адной эпохі ў наступную.
«А, лекар? Ён з намі столькі, колькі я сябе памятаю, — кажа стары вясковец з пашанай у голасе. — Ягоная мудрасьць і лекі ўратавалі незьлічоныя жыцьці, нават мой дзед зьвяртаўся да яго па дапамогу».
Іншы вясковец дадае: «Так, я быў яшчэ дзіцём, калі ўбачыў яго ўпершыню, а гэта было шмат дзесяцігодзьдзяў таму. Ён заўсёды быў побач, суцяшаў хворых і даваў надзею тым, хто страціў яе».
Словы вяскоўцаў здаюцца вам дзіўнымі: калі яны кажуць праўду, лекару мусіць быць за дзевяноста, а калі вы бачылі яго апошні раз, яму нельга было даць больш за пяцьдзесят. Сумнеў грызе вашыя думкі, нібы сама рэчаіснасьць скрывілася ў гэтай забытай богам вёсцы.
~found_age = true
->START.choices

===AtTheHealers===
~met_healer=true
Увайшоўшы ў жытло лекара, вы бачыце відовішча, якое адначасова прыкоўвае ўвагу й трывожыць. Пакой поўны хворых, на бледных тварах якіх чума пакінула свой сьлед. Адны ляжаць на ляжанках, курчачыся ад болю, другія сядзяць на крэслах, трывожна чакаючы сваёй чаргі на дапамогу. 

Лекар ходзіць па пакоі, рухаючыся плаўна й упэўнена. Ён гаворыць лагодныя словы суцяшэньня, ягоныя дотыкі далікатныя й пэўныя. Паліцы ўздоўж сьценаў гнуцца пад цяжарам незьлічоных бутэлечак, слоікаў і лекарскіх прыладаў. Мігатлівае сьвятло сьвечак кідае злавесныя цені, выхопліваючы то постаць адданага справе лекара, то ягоныя прылады.

Сярод лекавых зёлак і настоек ваш позірк спыняецца на нечым недарэчным — дзіўнай бутэлечцы зь цёмнай глейкай вадкасьцю, якая стаіць асобна ад астатніх. -> choices 

    =choices
    *[Агледзець дзіўную бутэлечку. {print_player_skill_chance("Medicine", EASYSKILLCHECK)}]
        {perform_player_skill_check("Medicine", EASYSKILLCHECK): -> succeed | -> fail}
    *[Спытаць лекара пра бутэлечку.] -> inquire
    *{found_vial}[Запатрабаваць ад лекара тлумачэньняў.] -> ConfrontHealer
    *{found_vial}[Пакінуць адкрыцьцё пры сабе й працягнуць расьсьледаваньне.] -> START.choices
    *[Сысьці.] -> START.choices

    =succeed
    Вы разглядаеце бутэлечку з усё большай трывогай. Вашае дасьведчанае вока распазнае яе сапраўднае зьмесьціва — падступную крыніцу заразы, моцнае й агіднае рэчыва, якое сілкуе тую самую чуму, што паглынае вёску.
    ~found_vial = true
    ->choices
    
    =fail
    Вы зьбянтэжана разглядаеце бутэлечку, але ня можаце вызначыць яе прызначэньне ці зьмесьціва: вам бракуе лекарскіх ведаў, каб распазнаць яе сапраўдную прыроду. -> choices

    =inquire
    Вы глядзіце на лекара й наўпрост пытаецеся пра дзіўную бутэлечку. 
    «Для чаго гэтая бутэлечка? Яе зьмесьціва не падобнае да ніводных лекаў, што мне даводзілася бачыць», — пытаецеся вы зь цікаўнасьцю й асьцярогай у голасе. 
    Лекар сустракае ваш позірк; у ягоных вачах на імгненьне мільгае неспакой, але ён адказвае заспакаяльным голасам: «А, у гэтай бутэлечцы моцны экстракт рэдкай зёлкі — галоўны складнік магутнага сродку для абеззаражваньня. Ён дапамагае стрымліваць пашырэньне хваробы, абараняючы і хворых, і здаровых». Ён спакойна ўсьміхаецца, хаваючы за ўсьмешкай усялякую трывогу. 
    ~suspicious = true
    -> choices

===ObserveVillage===

Вы ідзяце пустэльнымі вуліцамі, пільна аглядаючы навакольле ў пошуках знакаў, што маглі б раскрыць праўду пра чуму й чуткі пра дзейнасьць культыстаў. Сярод занядбаных будынкаў і змучаных жыхароў вы заўважаеце дробязі, якія абуджаюць цікаўнасьць.

Вашае вока прыцягвае выцьвілы знак на абсыпанай сьцяне. Ён нагадвае сымбалі бога Хаосу Нургла й намякае на магчымую сувязь з чуткамі пра культыстаў. Убачыўшы чуму, вы ўжо падазравалі нешта падобнае, але аднаго знаку недастаткова, каб пацьвердзіць праўду.

Сярод спусташэньня вы заўважаеце дзіўную заканамернасьць. Вашую ўвагу прыцягваюць людзі, якіх не бярэ немач, што мучыць астатніх. Мужчыны гадоў ад трыццаці да сарака выпраменьваюць незвычайнае здароўе й жыцьцёвую сілу. Іхныя дужыя, мускулістыя целы рэзка вылучаюцца сярод кволых, схуднелых постацяў навокал. На шчоках — здаровы румянец, вочы зьзяюць стойкасьцю й моцай. Яны нібы выпраменьваюць само жыцьцё сярод змроку.

Іхнае выдатнае самаадчуваньне ўражвае вас. Гэтае выключнае здароўе спараджае пытаньні: што дае ім такую незвычайную стойкасьць? Ці ёсьць натуральнае тлумачэньне, або за іхнай бачнай непаражальнасьцю хаваецца нешта большае? -> choices

    =choices
    *[Паназіраць за штодзённымі справамі здаровых вяскоўцаў.] -> ObserveRoutine

===ObserveRoutine===
Зацікавіўшыся незвычайным здароўем гэтых мужчын, вы вырашаеце некалькі дзён назіраць за іхным распарадкам. Расьсьледаваньне прыводзіць да цікавага адкрыцьця: штораніцы, бяз вынятку, здаровыя вяскоўцы зьбіраюцца ў сьціплым жытле вясковага лекара.
Гэта абуджае вашую цікаўнасьць: лячэньне ім не патрэбнае, а ўсярэдзіне яны праводзяць даволі шмат часу. -> choices
    
    =choices
    *[Увайсьці ў жытло лекара, калі большасьць здаровых вяскоўцаў будзе ўсярэдзіне.] -> AtTheHealersAgain

===AtTheHealersAgain===
Цікаўнасьць бярэ верх, і вы вырашаеце скарыстаць нагоду й увайсьці ў жытло лекара {met_healer: зноў}, калі здаровыя вяскоўцы зьбіраюцца ўсярэдзіне. Ледзь вы пераступаеце парог, вас сустракае вусьцішны від. У жытле паўзмрок, паветра напоўненае пахам зёлак і ладану. З аднаго боку пакоя ляжаць некалькі цяжкахворых вяскоўцаў: яны стогнуць ад болю, іхныя целы зьнявечаныя чумой. 
Але няма й сьледу ні лекара, ні здаровых вяскоўцаў, якіх вы толькі што бачылі ля ўваходу.
~suspicious = true
->choices

    =choices
    *[Агледзецца й пашукаць падказкі, куды яны маглі зьнікнуць.{print_player_skill_chance("Scouting", EASYSKILLCHECK)}]
        {perform_player_skill_check("Scouting", EASYSKILLCHECK): -> succeed | -> fail}
    *{found_passage}[Без ваганьняў спусьціцца пад зямлю.] -> Descend
    *{not found_passage}[Спыніць пошукі й сысьці.] -> START.choices

    =succeed
    Ваш позірк абводзіць пакой у пошуках хоць нейкай падказкі, што магла б патлумачыць іхнае раптоўнае зьнікненьне. Уздоўж сьценаў стаяць паліцы з бутэлечкамі, зельлем і старажытнымі фаліянтамі пра розныя спосабы лячэньня. У пакоі адчуваецца дзіўнае напружаньне, нібы тут хаваецца таямніца, якая чакае разгадкі.
    Асьцярожна аглядаючыся далей, вы заўважаеце патаемны праход за цяжкім габэленам. Вы міжволі падыходзіце бліжэй, сэрца калоціцца ў прадчуваньні. Праход, здаецца, вядзе пад зямлю, у невядомую цемру, што вабіць раскрыць яе таямніцы.
    ~found_passage=true
    ->choices
    
    =fail
    Ваш позірк абводзіць пакой у пошуках хоць нейкай падказкі, што магла б патлумачыць іхнае раптоўнае зьнікненьне. Вы старанна аглядаеце кожны закутак, праводзіце рукамі па паліцах і сьценах, шукаючы патаемны праход. Аднак, як ні стараецеся, відавочнага шляху да разгадкі няма.
    Расчараваньне й зьбянтэжанасьць нарастаюць: гэтая сытуацыя ставіць вас у тупік. Лекар і здаровыя вяскоўцы нібы зьніклі бясьсьледна, пакінуўшы больш пытаньняў, чым адказаў. Можа, яны адчулі вашую прысутнасьць і незаўважна ўсьлізнулі?->choices

===GatherThoughts===
Вы знаходзіце хвіліну, каб сабрацца з думкамі. Адыходзіце ў ціхі куток вёскі, далей ад чужых вачэй, і старанна пераглядаеце ўсе сабраныя доказы.
Здаровыя вяскоўцы, якіх нібы не кранула чума, застаюцца загадкай. Іхнае моцнае здароўе, жвавая энэргія й невытлумачальная неўспрымальнасьць супярэчаць розуму. Яны — само ўвасабленьне жыцьця сярод адчаю, што паглынае вёску.
Аднак іхная сувязь зь лекарам выклікае больш пытаньняў, чым дае адказаў. Калі лекар сапраўды дапамагаў вёсцы цягам пакаленьняў, ён мусіў бы быць кволым старым, але гэта зусім ня так. Апошнім разам ён здаваўся мужчынам у росквіце сілаў, над якім ня ўладны час.
Сымбаль Нургла на абсыпанай сьцяне намякае на магчымую сувязь з чуткамі пра культыстаў. Прысутнасьць такога знаку кідае злавесны цень на і без таго змрочную вёску. 
Да таго ж вам не дае спакою падазроная бутэлечка з жытла лекара. {not found_vial: Яе зьмесьціва застаецца невядомым, а тлумачэньне лекара выклікае сумневы наконт яе сапраўднага прызначэньня. Ці можа гэта быць крыніцай заразы, або гэта сапраўды бяскрыўдныя лекі, як ён сьцьвярджае?}{found_vial: Вы цалкам упэўненыя, што зьмесьціва бутэлечкі выкарыстоўваюць для пашырэньня эпідэміі. Але дзеля чаго? Гэта яшчэ трэба высьветліць.}
У вашым розуме ўкараняецца жахлівае падазрэньне. Ці ня зьвязаны сам лекар нейкім чынам з чумой і чуткамі пра культыстаў? Ці не хаваецца нешта патаемнае за ягонай дабрадзейнай маскай? З новай рашучасьцю вы нарэшце вырашаеце запатрабаваць ад лекара тлумачэньняў.
->ConfrontHealer

===ConfrontHealer===
{came_from(-> GatherThoughts): Поўныя рашучасьці, вы зноў уваходзіце ў жытло лекара, гледзячы на ўсё з улікам новых ведаў.} Калі вы набліжаецеся, лекар сустракае ваш позірк. На імгненьне паміж вамі ўзьнікае маўклівае разуменьне: праўда раскрытая.
Адчуўшы цяжар вашых падазрэньняў, лекар крывіцца ад страху й адчаю. Не прамовіўшы ні слова, ён разварочваецца й кідаецца ў далёкі канец пакоя, адчайна спрабуючы ўцячы ад вашага позірку.
«Стой!» — крычыце вы й кідаецеся ў пагоню, калі ён дасягае задняй часткі жытла. Імклівым рухам ён адкрывае патаемны люк, адкідвае вечка й зьнікае ўнізе. Вы не вагаецеся й рушыце сьледам, спускаючыся вузкімі прыступкамі ў невядомую цемру. -> choices
    
    =choices
    *[Без ваганьняў пайсьці сьледам, спускаючыся вузкімі прыступкамі ў невядомую цемру.] -> Descend
    

===Descend===
~ OpenCultistLairMission("TOR_quest_nurgle_lair_001")
...
{MadeDealWithCultists && not DealtWithCultists: Вочы правадыра культу блішчаць трыюмфам і задавальненьнем, калі ён адчувае вашую згоду. Ягоны сьпеў набывае гіпнатычную моц, адгукаючыся ў вашай душы, нібы пляце непарушную сувязь. Вас ахоплівае дзіўнае й трывожнае пачуцьцё, нібы тагасьветная сіла пачынае ўплятацца ў самую вашую сутнасьць. }
{MadeDealWithCultists && not DealtWithCultists: Пачынаецца невымоўнае ператварэньне, нібы разгортваецца сон, сатканы з рэчаіснасьці. Па жылах праносіцца прыліў энэргіі, ажыўляючы цела й праганяючы стому. Боль нібы сьціхае, раны загойваюцца, пакідаючы абноўленую жыцьцёвую сілу.}
{MadeDealWithCultists && not DealtWithCultists: Прыняўшы Дар, вы пакідаеце памяшканьне, несучы цяжар свайго рашэньня. Вёска застаецца ўдалечыні, а прыглушаныя крыкі яе хворых жыхароў адгукаюцца ў вушах, пакуль вы адыходзіце.}
{MadeDealWithCultists && not DealtWithCultists: Вашае падарожжа працягваецца пад гнётам прынятага рашэньня. Дар Нургла надзяліў вас моцай і жыцьцёвай сілай, але й зьвязаў зь няпэўнай будучыняй, азмрочанай раскаяньнем.}
{not DealtWithCultists && not MadeDealWithCultists: Вашыя ўдары адбіваюць, абарона аказваецца марнай. Злавеснае майстэрства правадыра культу пераўзыходзіць усе вашыя чаканьні, і пасьля апошняга зьнішчальнага ўдару сілы пакідаюць вас. Цемра паглынае пачуцьці, і прытомнасьць раствараецца ў нябыце.}
{not DealtWithCultists && not MadeDealWithCultists: Празь некалькі гадзінаў, а можа, праз цэлую вечнасьць, вы прачынаецеся сярод крыкаў хворых. Зьбітае, зьнявечанае цела баліць, водгульле паразы адгукаецца ў кожнай часьцінцы вашай істоты. Разгубленыя й параненыя, вы апынаецеся сярод тых самых вяскоўцаў, якіх імкнуліся ўратаваць.}
{not DealtWithCultists && not MadeDealWithCultists: Вы зь цяжкасьцю паўзеце праз спусташэньне, прабіраючыся сярод пакутнікаў; кожны стогн і хрып сьведчыць пра бязьлітасную хватку чумы. Усьведамленьне няўдачы цяжарам цісьне на вас, горкі смак паразы стаіць у роце.}
{not DealtWithCultists && not MadeDealWithCultists: Урэшце вам удаецца выбрацца з гэтага вартага жалю месца й дацягнуць зьнявечанае цела да лягера, дзе спынілася вашая партыя. Таварышы глядзяць на вас з трывогай і спачуваньнем, разумеючы ўсю глыбіню вашай паразы.}
{not DealtWithCultists && not MadeDealWithCultists: Без адзінага слова вы зьбіраеце рэшткі сілаў і рашучасьці, пакідаючы вёску зь яе змучанымі жыхарамі. Успамін пра сутычку з правадыром культу й няздольнасьць спыніць чуму перасьледуе кожны ваш крок.}
{not DealtWithCultists && not MadeDealWithCultists: Вы адыходзіце, вёска зьнікае з вачэй, але яе пакуты навекі ўразаюцца ў памяць. Цяжар паразы цісьне на вас, пакідаючы нязмыўны напамін пра цемру, якую вы ня здолелі разагнаць.}
{DealtWithCultists && not MadeDealWithCultists: Параза правадыра культу адгукаецца ва ўсім падземным логаве й дасягае самага сэрца ахопленай чумой вёскі наверсе. Выйшаўшы вонкі, вы бачыце, як хворыя вяскоўцы выходзяць са сваіх халупаў; на іхных тварах — недавер і наноў здабытая надзея.}
{DealtWithCultists && not MadeDealWithCultists: Вёска пачынае ачуняць, яе жыхары павольна, але няўхільна вызваляюцца ад пакутаў, што трымалі іх у палоне. Калі вашая партыя далучаецца да вас, на тварах паплечнікаў адбіваецца ўдзячнасьць усёй вёскі.}
{DealtWithCultists && not MadeDealWithCultists: Выканаўшы сваю справу, вы пакідаеце вёску, жыхары якой сталі на шлях выздараўленьня. Памяць пра вашую перамогу, пра бітву зь цемрай, застаецца ў іхных сэрцах сьведчаньнем моцы чалавечага духу.}

->END