//Global story tags
# title: Бос Прачынаецца
# frequency: Special
# development: false
# illustration: orc_boss_career_2

INCLUDE include.ink

//Variables setup
VAR QuestToStart = ""

->START

===START===
Гэта прыходзіць раптам — ня думка й не пачуцьцё. Нешта бліжэйшае да інстынкту. Сэрца пачынае біцца хутчэй. Унутры нешта варушыцца: азарт. Нецярпеньне. Трэба рухацца. Трэба ЗАБІВАЦЬ.

Голас шэпча, а потым раве. Ён падганяе вас.

«Буйней… лепей… машней… забіваць… ЗАБІВАЦЬ… ВААААААААААААААГХ!»

Знак багоў? Голас вядзе вас, гоніць наперад. Праігнараваць яго — наклікаць гнеў Горка й Морка.

Багі абралі вас. ВАС. Далі шанец паказаць сябе перад імі.
Вы мусіце ўзвысіцца. Прыняць выклікі. Разбурыць усё. Але найперш ЗАБІВАЦЬ.

+ [НУ ДАВАЙ ЗРОБІМ ЭТА!]
    ~ StartQuest("Quests.Careers.OrcBossQuest1")
    ~ CloseStory()
    -> END

    
    