//Global story tags
# title: Паўстае Буйнабос
# frequency: Special
# development: false
# illustration: orc_boss_career_2

INCLUDE include.ink

//Variables setup
VAR QuestToStart = ""

->START

===START===
Пад пільнымі позіркамі Горка й Морка вы раз за разам даводзілі сваю вартасьць. Вы бос, вы ваяр, вы сама сьмерць на полі бітвы, і за вамі ляжаць незьлічоныя трупы.

Вашая банда хлопцаў ідзе за вамі, баіцца й паважае вас. Яны ведаюць, што вы прывядзяце іх да найбольшых боек і найбагацейшай здабычы.

Вы сталі босам сярод босаў, але багам гэтага мала. Заўсёды было мала й заўсёды будзе. Наперадзе яшчэ шмат справаў.

+ [Я БУДУ НАЙВЯЛІКІМ НАЗАЎЖДЫ!!]
    -> confirm_big_boss

===confirm_big_boss===
Вы глядзіце на сваіх хлопцаў: ім ня церпіцца, яны гатовыя. Вы глядзіце на далягляд: ваш шлях быў доўгі, усеяны здабычай, бліскучымі цацкамі й трупамі ўсіх нікчэмаў, што сталі вам упоперак.

Ніводны вораг не адважваецца сустрэць вас у адкрытым баі, таму вы мусіце самі прынесьці ім вайну, сарваць іх са сьценаў і выцягнуць з дамоў пад іхныя крыкі.

Час прыйшоў: зялёная навала пад вашым чалом затопіць сьвет.

+ [РАЗГРАМІЦЕ ЎСІХ!! ВААААААААААААААААГХ!!!]
    ~ StartQuest("Quests.Careers.OrcBossQuest2")
    ~ CloseStory()
    -> END