//Global story tags
# title: Бачаньне Горка й Морка
# frequency: Special
# development: false
# illustration: orc_shaman_career_2

INCLUDE include.ink

->START

===START===
Вы знайшлі капішча — грубыя ідалы Горка й Морка, высечаныя зь вялізных грудаў каменьня й гною.

Вакол раскіданая зброя й панцыры, якіх вы ніколі раней ня бачылі. У нечым вы пазнаяце працу дварфаў, але паходжаньне астатняга вам не зразумець.

Вы самотна крочыце наперад. Чым бліжэй, тым больш едкі смурод. Дайшоўшы да найбольшай кучы гною, вы глыбока ўдыхаеце тухлыя выпарэньні. Яны запаўняюць усе вашыя пачуцьці, і вы правальваецеся ў непрытомнасьць.

Тады з'яўляюцца ЯНЫ.

Два зялёныя волатаўскія сылюэты, што няспынна змагаюцца й лупяць адзін аднаго.

Тагасьветныя галасы й відовішчы напаўняюць ваш тоўсты чэрап пад бязладны роў і грымотны рогат: палаючыя гарады, грукат барабанаў, зялёная навала, што крочыць, топчучы трупы й паламаныя сьцягі. Ідалаў слабых, вартых жалю багоў людзей і дварфаў кідаюць у бруд, разьбіваюць або перарабляюць у грубыя постаці Горка й Морка.

Сярод руінаў і хлопцаў, што балююць, вы бачыце постаць, якая танчыць і шалёна рагоча, пакуль на поле бітвы сыплюцца траскучыя зялёныя маланкі энэргіі.

Гэта вы.

Тады вы прачынаецеся.

Паветра трымціць у прадчуваньні. І вашае прызначэньне зразумелае.

+ [БУДУ ШАМЫМ ЛЕПШЫМ ШАМАНАМ!!!]
    ~ CloseStory()
    -> END
