//Global story tags
# title: Багі Патрабуюць Больш!
# frequency: Special
# development: false
# illustration: orc_shaman_career_2

INCLUDE include.ink

->START

===START===
Вы вярнуліся да капішча. Вашы джу-джу Вааагх! узмацніўся, вера паглыбілася, і багі сапраўды блаславілі вас. Прыйшоў час увасобіць вашыя бачаньні ў жыцьцё.

Вы зноў падыходзіце да найбольшай кучы гною й глыбока ўдыхаеце, яшчэ раз пагружаючыся ў валадарства Горка й Морка.

Багі на імгненьне перастаюць лупіць адзін аднаго й выглядаюць задаволенымі, але толькі цяпер вы атрымалі сапраўдны шанец паказаць сябе.

Ваш зялёны розум зноў напаўняюць бачаньні: болей бітваў, болей ворагаў, якіх трэба разьбіць, болей плямёнаў, якіх трэба аб'яднаць пад сапраўдным сьцягам Горка й Морка. Палаючыя гарады руйнуюцца пад вашым Вааагх!, а цьвярдыні дварфаў захопленыя й разьбітыя.

Іхныя слабыя багі прыніжаныя, капішчы апаганеныя й пахаваныя пад сьмярдзючымі кучамі гною. А вы зноў стаіце ў самым цэнтры й глядзіце, як велізарны храмавы комплекс развальваецца — яго разьбіраюць камень за каменем.

Усе астатнія шаманы й хлопцы падаюць на калені й прызнаюць вас САПРАЎДНЫМ прарокам Горка й Морка, НАЙЗЕЛЯНЕЙШЫМ прарокам.

Тады вы прачынаецеся.

Хлопцы чакаюць вашых загадаў. Прыйшоў час затапіць сьвет зялёным, і Багі-Блізьняты будуць танчыць сярод попелу мёртвых імперыяў.

+ [ЗА ГОРКА Й МОРКА!! ВАААААААААААААААГХ!!!]
    ~ StartQuest("Quests.Careers.OrcShamanQuest2")
    ~ CloseStory()
    -> END