//Global story tags
# title: Покліч Багоў
# frequency: Special
# development: false
# illustration: orc_shaman_career_2

INCLUDE include.ink

//Variables setup
VAR QuestToStart = ""

->START

===START===
Пасьля доўгай ночы танцаў вы прачынаецеся з жахлівым галаўным болем. Галава ў вас балела й раней, але гэтым разам усё іначай.

Боль пульсуе, нібы самі багі трасуць вас з боку ў бок.

Некалькі хлопцаў зьбіраюцца вакол і глядзяць з трапятаньнем і страхам. Вы падаеце на калені й ванітуеце зялёнай жоўцю на зямлю.

У сьмярдзючай кашы вы бачыце кавалкі мяса й аскепкі касьцей, што склаліся ў выяву капішча зь ідаламі Горка й Морка.

Багі клічуць, час адгукнуцца.

+ [Дзе эта праклятае месца!?]
    ~ StartQuest("Quests.Careers.OrcShamanQuest1")
    ~ CloseStory()
    -> END
