//Global story tags
# title: Вандроўны Гандляр
# frequency: Abundant
# development: false
# illustration: trader

INCLUDE include.ink

->START

===START===
Падарожнічаючы пыльнымі дарогамі, вы бачыце незвычайнае відовішча — маляўнічы караван, перасоўную краму сярод ціхіх краявідаў. #STR_Start1
Калі вы набліжаецеся, да вас падыходзіць вандроўны гандляр. З прыветнай усьмешкай ён распавядае пра далёкія гаспадарствы й запрашае аглядзець свае тавары. #STR_Start2
->choices
    
    =choices
    +[Аглядзець ягоныя тавары]
        ~ OpenInventoryAsTrade()
    ->AfterShopping
    *[Працягнуць падарожжа (Сысьці)] 
        Вы вырашаеце, што пакуль лепей рушыць далей. #STR_Leave
        ->END

===AfterShopping===
Вы канчаеце агляд гандляровых скарбаў, і ён з паважным паклонам дзякуе вам за цікавасьць і выбар. #STR_AfterShopping
    -> END
